Repository: Aryanryn09/Workbench
Catalog: po/*.po
Languages: es, it, ru

source: Learn and prototype with GNOME technologies
es: Aprende y crea proptipos con las tecnologías de GNOME
it: Impara e sviluppa con le tecnologie di GNOME
ru: Изучайте и создавайте прототипы с технологиями GNOME

source: Workbench goal is to let you experiment with GNOME technologies, no matter if tinkering for the first time or building and testing a GTK user interface.
es: El objetivo de WorkBench es que puedas experimentar con las tecnologías de GNOME, no importa si es tu primera vez haciendo retoques, o construyendo y probando una interfaz de usuario GTK.
it: L'obbiettivo di Workbench è di farti sperimentare con le tecnologie GNOME, anche se fosse la prima volta che stai creando o provando un interfaccia utente GTK.
ru: Цель Workbench — позволить вам экспериментировать с технологиями GNOME, независимо от того, делаете ли вы это впервые или создаете и тестируете пользовательский интерфейс GTK.

source: Among other things, Workbench comes with
es: Entre otras cosas, Workbench incluye
it: Tra le altre cose, Workbench è dotato di
ru: Среди прочего, Workbench поставляется с

source: realtime GTK/CSS preview
es: previsualización GTK/CSS en tiempo real
it: anteprima GTK/CSS in tempo reale
ru: предпросмотром GTK/CSS в реальном времени

source: library of examples
es: librería de ejemplos
it: libreria degli esempi
ru: библиотекой примеров

source: JavaScript and Vala runs without any setup
it: JavaScript e Vala funzionano senza alcuna configurazione
ru: JavaScript и Vala работают без какой-либо настройки

source: XML and Blueprint for describing user interface
es: XML y Blueprint para describir la interfaz de usuario
it: XML e Blueprint per creare interfaccie grafiche
ru: XML и Blueprint для описания пользовательского интерфейса

source: syntax highlighting, undo/redo, autosave, session restore
es: Resaltado de sintaxis, deshacer/rehacer, guardado automático, restauración de la sesión
it: evidenziazione della sintassi, annulla/ripristina, salvataggio automatico, ripristino della sessione
ru: подсветкой синтаксиса, отмена/повтор, автосохранение, восстановление сеанса

source: code formatter
es: formateador de código
it: formattazione del codice
ru: средством форматирования кода

source: console logs
es: logs en consola
it: Log in Console
ru: журналами консоли

source: Highlights
es: Resaltados
it: Punti salienti
ru: Особенности

source: Add Blueprint markup syntax for UI
es: Añadir la sintaxis de marcado de Blueprint para la IU
it: Aggiunta della sintassi di markup Blueprint per l'interfaccia utente
ru: Добавлена поддержка синтаксиса разметки Blueprint для UI

source: Add Vala programming language for Code
es: Añadir lenguaje de programación Vala
it: Aggiungi il linguaggio di programmazione Vala per Code
ru: Добавлен язык программирования Vala для кода

source: Add support for previewing templates
es: Añadir soporte para previsualización de plantilas
it: Aggiungere il supporto per l'anteprima dei modelli
ru: Добавлена поддержка предпросмотра шаблонов

source: Add support for previewing signal handlers
es: Añadir soporte para previsualización de manejadores de señales
it: Aggiungere il supporto per l'anteprima dei gestori di segnali
ru: Добавлена поддержка предпросмотра обработчиков сигналов

source: Include all icons from icon-development-kit
es: Incluir todos los íconos de icon-development-kit
it: Includere tutte le icone del icon-development-kit
ru: Включены все значки из комплекта разработки значков

source: Improve application design
es: Mejorar el diseño de la aplicación
it: Migliorare la progettazione dell'applicazione
ru: Улучшен дизайн приложения

source: Distribute Library examples under CC0-1.0
es: Distribuir Librerías de ejemplo bajo CC0-1.0
it: Distribuisci esempi sotto licenza CC0-1.0
ru: Распространение примеров библиотеки под CC0-1.0

source: Respect system preference for color scheme
es: Respetar la preferencia del esquema de color del sistema
it: Rispettare le preferenze del sistema per la combinazione di colori
ru: Следует предпочтению системы для цветовой схемы

source: Add proper light/dark color schemes for Console
es: Añadir esquemas de color claro/oscuro apropiados para Console
it: Aggiungi schema di colore chiaro/scuro adeguato per la console
ru: Добавьлена правильная светлая/темная цветовая схема для консоли

source: Fix error when opening file
it: Correggere l'errore all'apertura del file
ru: Исправлена ошибка при открытии файла

source: Other changes
es: Otros cambios
it: Altre modifiche
ru: Другие изменения

source: Silence platform tools
es: Herramientas de plataforma de silencio
it: Silenzia strumenti di piattaforma
ru: Инструменты платформы Silence

source: Make Library examples only open relevant panels
es: Hacer que las Librerías de ejemplo solo abran paneles relevantes
it: Gli esempi della Libreria aprono solo i pannelli pertinenti
ru: Сделано так, чтобы примеры библиотеки открывали только соответствующие панели

source: Always open the Console when opening a Library example
es: Siempre abrir la Consola cuando se abra una Librería de ejemplo
it: Aprire sempre la console quando si apre un esempio di libreria
ru: Теперь всегда открывается консоль при открытии примера библиотеки

source: Prevent running Code if the panel is not visible
es: Prevenir correr el Código si el panel no está visible
it: Impedisci l'esecuzione del Codice se il pannello non è visibile
ru: Добавлено предотвращение запуска кода, если панель не видна

source: Add icons and mnemonics for all buttons
es: Añadir íconos y mnemotecnias para todos los botones
it: Aggiungi icone e scorciatoie per tutti i pulsanti
ru: Добавлены значки и мнемоники для всех кнопок

source: Move Bookmarks to the main menu
es: Mover Marcadores al menú principal
it: Sposta Preferiti nel menù principale
ru: Закладки перемещены в главное меню

source: Enable scrollbar and kinetic scrolling on Console
es: Habilitar barra de desplazamiento en la Consola
it: Abilita scrollbar e scrolling cinetico sulla Console
ru: Включены полосы прокрутки и кинетическая прокрутка в консоле

source: Improve Library examples
es: Mejorar Librería de ejemplos
it: Migliora la libreria di esempi
ru: Улудшены примеры библеотек

source: Performance optimizations
es: Optimizaciones de rendimiento
it: Ottimizzazioni per la performance
ru: Оптимизация производительности

source: Show a placeholder when all panels are invisible
es: Mostrar un placeholder cuando todo los paneles son invisibles
it: Mostra un placeholder quando tutti i pannelli sono nascosti
ru: Теперь будет отображаться заглушка, когда все панели невидимые

source: Crash fixes
es: Corrección de fallas
it: Correzioni per crash
ru: Исправлены сбои

source: Use org.gnome.Sdk runtime
es: Usar org.gnome.Sdk
it: Usa il runtime org.gnome.Sdk
ru: Используется среда выполнения org.gnome.Sdk

source: Add a Library of examples
es: Agregar una librería de ejemplos
it: Aggiungi una libreria di esempi
ru: Добавлена библиотека примеров

source: Add an example of WebSocket client
es: Agregar un ejemplo de cliente WebSocket
it: Aggiungi un esempio di client WebSocket
ru: Добавлен пример клиента WebSocket

source: Add an example of toasts
es: Agregar un ejemplo de avisos
it: Aggiungi un esempio di avviso toast
ru: Добавлен пример тостов

source: Add an example of application window
es: Agregar un ejemplo de ventana de aplicación
it: Aggiungi un esempio di finestra applicazione
ru: Добавлен пример окна приложения

source: Add an example of desktop notification
es: Agregar un ejemplo de notificación de escritorio
it: Aggiungi un esempio di notifica desktop
ru: Добавлен пример уведомления рабочего стола

source: Add Adwaita Demo, GTK Demo, GTK Widget Factory and GTK Icon Browser
es: Agregar Adwaita Demo, GTK Demo, GTK Widget Factory y GTK Icon Browser
it: Aggiungi Adwaita Demo, GTK Demo, GTK Widget Factory e GTK Icon Browser
ru: Добавлены Adwaita Demo, GTK Demo, GTK Widget Factory и GTK Icon Browser

source: The Console can be collapsed by resizing it
es: La consola puede ser colapsada redimensionándola
it: La Console si può chiudere ridimensionandola
ru: Консоль теперь может быть скрыта путём изменения размера

source: Prevent system.exit from quitting Workbench
es: Prevenir system.exit cuando salgas de Workbench
it: Impedisci a system.exit di chiudere Workbench
ru: Предотвращен выход system.exit из Workbench

source: Allow calling GObject.registerClass multiple times
es: Permitir llamados a GObject.registerClass múltiples veces
it: Permetti la chiamata multipla di GObject.registerClass
ru: Разрешен многоразовый вызов GObject.registerClass

source: Prevent crash caused by using non GtkBuildable objects
es: Prevenir cierres causados al utilizar objetos no GTKBuildable
it: Previeni crash dall'uso di oggetti non GtkBuildable
ru: Предотвращение сбоя, вызванного использованием объектов, отличных от GtkBuildable

source: Allow using DBus and Gio.Application
es: Permitir el uso de DBus y Gio.Application
it: Permetti l'uso di DBus e Gio.Application
ru: Разрешено использование DBus и Gio.Application

source: Allow using network
es: Permitir el uso de la red
it: Permetti l'uso della rete
ru: Разрешено использование интернета

source: Enable GtkWindow objects preview
es: Permitir la previsualización de objetos GtkWindow
it: Abilita l'anteprima di oggetti GtkWindow
ru: Включен предварительный просмотр объектов GtkWindow

source: Take a png screenshot of the preview
es: Tomar una captura png de la previsualización
it: Cattura l'anteprima come png
ru: Можно сделать скриншот предварительного просмотра в формате png

source: The console is now resizable
es: La consola ahora es redimensionable
it: Ora la Console è ridimensionabile
ru: Размер консоли теперь можно изменять

source: Redesign the dark/light mode switcher
es: Rediseñar el conmutador de modo oscuro/claro
it: Redesign dello switcher della modalità chiara/scura
ru: Переработан переключатель темного/светлого режима

source: Show platform and dependencies in about dialog
es: Mostrar la plataforma y dependencias en el diálogo acerca de
it: Mostra piattaforma e dipendenze in "Informazioni su Workbench"
ru: Теперь показана платформа и зависимости в диалоговом окне «О программе»

source: Update to GNOME platform 42
es: Actualizar a la plataforma GNOME 42
it: Aggiorna a piattaforma GNOME 42
ru: Обновление до платформы GNOME 42

source: Various fixes
es: Arreglos varios
it: Fix vari
ru: Различные исправления

source: This is the first release of Workbench. We hope you like it.
es: Este es el primer lanzamiento de Workbench. Esperamos que te guste.
it: Questa è la prima versione di Workbench. Speriamo che ti piaccia.
ru: Это первый выпуск Workbench. Мы надеемся, что Вам понравится.

source: Library
es: Librería
it: Libreria
ru: Библиотека

source: Keyboard Shortcuts
es: Atajos de Teclado
it: Scorciatoie da tastiera
ru: Комбинации клавиш

source: About My App
it: Informazioni sulla mia app
ru: О моем приложении

source: Learn and prototype with GNOME technologies
it: Impara e prototipa con tecnologie GNOME
ru: Учитесь и прототипируйте с технологиями GNOME

source: translator-credits
es: Mateo Estrada Ramirez mateoestradaramirez@outlook.com
it: Alessandro Iepure https://github.com/aleiepure
ru: Давид Лапшин <ddaudix@gmail.com> ViktorOn https://github.com/ViktorOn

source: Import File
es: Importar Archivo
it: Importa file
ru: Импортировать файл

source: All supported
es: Todos los soportados
it: Tutti i file supportati
ru: Все поддерживается

source: Run Code
es: Correr Código
it: Esegui Codice
ru: Запустить код

source: Open Library
es: Abrir Librería
it: Apri la libreria
ru: Открыть библиотеку

source: Toggle Console
es: Alternar Consola
it: Apri/Chiudi Console
ru: Переключить консоль

source: Clear Console
es: Limpiar Consola
it: Cancella Console
ru: Очистить консоль

source: Inspector
it: Ispettore
ru: Инспектор

source: Undo
es: Deshacer
it: Indietro
ru: Назад

source: Redo
es: Rehacer
it: Avanti
ru: Вперед

source: Quit
es: Salir
it: Esci
ru: Выйти

source: _Library
es: _Librería
it: _Libreria
ru: _Библиотека

source: Open Library of Demos and Examples (Ctrl+Shift+O)
es: Abrir Librería de Demos y Ejemplos (Ctrl+Shift+O)
it: Apri la libreria di Demo ed Esempi (Ctrl+Shift+O)
ru: Открыть библиотеку демонстраций и примеров (Ctrl+Shift+O)

source: _Code
es: _Código
it: _Codice
ru: _Код

source: _Style
es: _Estilo
it: _Stile
ru: _Стиль

source: _Preview
es: _Previsualizar
it: _Anteprima
ru: _Предпросмотр

source: Use Light mode
it: Usa modalità chiara
ru: Использовать светлый режим

source: Use Dark mode
it: Usa modalità scura
ru: Использовать темный режим

source: <b>Code</b>
es: <b>Código</b>
ru: <b>Код</b>

source: Switch document
es: Cambiar documento
it: Cambia documento
ru: Переключить документ

source: _Run
es: _Correr
it: _Esegui
ru: _Запустить

source: Run (Ctrl+⏎)
es: Ejecutar (Ctrl+⏎)
it: Esegui (Ctrl+⏎)
ru: Запустить (Ctrl+⏎)

source: <b>Style CSS</b>
es: <b>Estilo - CSS</b>
ru: <b>Стиль CSS</b>

source: Convert to XML
es: Convertir a XML
it: Converti in XML
ru: Конвертировать в XML

source: Convert to Blueprint
es: Convertir a Blueprint
it: Converti in Blueprint
ru: Конвертировать в Blueprint

source: <b>Preview</b>
es: <b>Previsualizar</b>
ru: <b>Предпросмотр</b>

source: Take Screenshot of Preview
es: Tomar una Captura de la Previsualización
it: Cattura l'anteprima
ru: Сделать скриншот предпросмотра

source: Windowed Preview
es: Previsualización en Ventana
it: Anteprima in finestra
ru: Предпросмотр в окне

source: This interface can only be previewed as a separate window. We recommend using “Always on Top”
it: Questa interfaccia può essere mostrata solo in una finestra separata. Si consiglia di usare "Sempre in cima"
ru: Этот интерфейс можно просмотреть только как отдельное окно. Мы рекомендуем использовать «Всегда сверху»

source: Show Preview Window
es: Mostrar Ventana de Previsualización
it: Mostra finestra anteprima
ru: Показать окно предпросмотра

source: Close Preview Window
es: Cerrar Ventana de Previsualización
it: Chiudi finestra anteprima
ru: Закрыть окно предпросмотра

source: C_onsole
es: C_onsola
ru: К_онсоль

source: Show logs (Ctrl+Shift+K)
es: Mostrar logs (Ctrl+Shift+K)
it: Mostra log (Ctrl+Shift+K)
ru: Показать журналы (Ctrl+Shift+K)

source: _Inspector
it: _Ispettore
ru: _Инспектор

source: Open GTK Inspector (Ctrl+Shift+I)
es: Abrir inspector GTK (Ctrl+Shift+I)
it: Apri l'ispettore GTK (Ctrl+Shift+I)
ru: Открыть Инспектор GTK (Ctrl+Shift+I)

source: Cl_ear
es: L_impiar
it: C_ancella
ru: Оч_истить

source: Clear console (Ctrl+K)
es: Limpiar consola (Ctrl+K)
it: Cancella console (Ctrl+K)
ru: Очистить консоль (Ctrl+K)

source: Import File…
es: Importar Archivo…
it: Importa file…
ru: Импортировать файл…

source: Bookmarks
es: Marcadores
it: Preferiti
ru: Закладки

source: Learn
es: Aprende
it: Impara
ru: Учиться

source: Developer Documentation
es: Documentación de desarrorollador
it: Documentazione sviluppatori
ru: Документация для разработчиков

source: Human Interface Guidelines
es: Pautas de Interfaz Humana
it: Guida interfacce umane (HIG)
ru: Рекомендации по человеческому интерфейсу

source: Get help
es: Obtener ayuda
it: Ottieni aiuto
ru: Получить помощь

source: Discourse
ru: Обсудить

source: Platform Tools
es: Herramientas de Plataforma
it: Strumenti di piattaforma
ru: Инструменты платформы

source: About Workbench
es: Acerca de Workbench
it: Informazioni su Workbench
ru: О Workbench

source: Are you sure you want to discard your changes?
it: Sei sicuro di volere perdere tutte le modifiche?
ru: Вы уверены, что хотите отменить изменения?

source: _UI
es: _IU

source: <b>UI</b>
es: <b>IU</b>

source: Adwaita Demo
es: Demo Adwaita

source: GTK Demo
es: Demo GTK
